dinguluer/Renesas_FreeRTOS/RL78/CCRL/R5F104PJ/Bank register concept used/iodefine.h
#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTP5                           0x0012
#define INTCSI20                        0x0014
#define INTIIC20                        0x0014
#define INTST2                          0x0014
#define INTCSI21                        0x0016
#define INTIIC21                        0x0016
#define INTSR2                          0x0016
#define INTSRE2                         0x0018
#define INTTM11H                        0x0018
#define INTCSI00                        0x001E
#define INTIIC00                        0x001E
#define INTST0                          0x001E
#define INTCSI01                        0x0020
#define INTIIC01                        0x0020
#define INTSR0                          0x0020
#define INTSRE0                         0x0022
#define INTTM01H                        0x0022
#define INTCSI10                        0x0024
#define INTIIC10                        0x0024
#define INTST1                          0x0024
#define INTCSI11                        0x0026
#define INTIIC11                        0x0026
#define INTSR1                          0x0026
#define INTSRE1                         0x0028
#define INTTM03H                        0x0028
#define INTIICA0                        0x002A
#define INTTM00                         0x002C
#define INTTM01                         0x002E
#define INTTM02                         0x0030
#define INTTM03                         0x0032
#define INTAD                           0x0034
#define INTRTC                          0x0036
#define INTIT                           0x0038
#define INTKR                           0x003A
#define INTCSI30                        0x003C
#define INTIIC30                        0x003C
#define INTST3                          0x003C
#define INTCSI31                        0x003E
#define INTIIC31                        0x003E
#define INTSR3                          0x003E
#define INTTRJ0                         0x0040
#define INTTM10                         0x0042
#define INTTM11                         0x0044
#define INTTM12                         0x0046
#define INTTM13                         0x0048
#define INTP6                           0x004A
#define INTP7                           0x004C
#define INTP8                           0x004E
#define INTP9                           0x0050
#define INTCMP0                         0x0052
#define INTP10                          0x0052
#define INTCMP1                         0x0054
#define INTP11                          0x0054
#define INTTRD0                         0x0056
#define INTTRD1                         0x0058
#define INTTRG                          0x005A
#define INTSRE3                         0x005C
#define INTTM13H                        0x005C
#define INTIICA1                        0x0060
#define INTFL                           0x0062

#endif
